import { IPeriod } from './types'

export const periods: IPeriod[] = [
  {
    title: 'Экономика',
    startYear: 1920,
    endYear: 1939,
    dates: [
      {
        year: 1920,
        eventDescription:
          'Лига Наций основана для поддержания мира и безопасности.',
      },
      {
        year: 1929,
        eventDescription:
          'Началась Великая депрессия, вызвавшая массовую безработицу и кризис.',
      },
      {
        year: 1933,
        eventDescription:
          'Рузвельт ввел Новый курс, помогший восстановлению экономики США.',
      },
      {
        year: 1936,
        eventDescription:
          'Берлинская Олимпиада продемонстрировала политическое напряжение и масштаб.',
      },
      {
        year: 1939,
        eventDescription:
          'Первый цветной фильм изменил восприятие киноиндустрии навсегда.',
      },
    ],
  },
  {
    title: 'Наука',
    startYear: 1945,
    endYear: 1960,
    dates: [
      {
        year: 1947,
        eventDescription:
          'Изобретение транзистора революционизировало электронику и современные устройства.',
      },
      {
        year: 1953,
        eventDescription:
          'Расшифровка структуры ДНК открыла путь к генетическим исследованиям.',
      },
      {
        year: 1957,
        eventDescription:
          'Запуск первого спутника ознаменовал начало космической эры.',
      },
      {
        year: 1960,
        eventDescription:
          'Лазеры вошли в науку, нашли применение в медицине и коммуникациях.',
      },
    ],
  },
  {
    title: 'Космос',
    startYear: 1960,
    endYear: 1980,
    dates: [
      {
        year: 1961,
        eventDescription:
          'Юрий Гагарин стал первым человеком в космосе, символ прогресса.',
      },
      {
        year: 1969,
        eventDescription: 'Высадка на Луну объединила человечество и науку.',
      },
      {
        year: 1971,
        eventDescription:
          'Салют-1 позволила проводить длительные эксперименты в космосе.',
      },
      {
        year: 1977,
        eventDescription:
          'Запуск Вояджеров исследовать дальний космос, миссии продолжаются.',
      },
    ],
  },
  {
    title: 'Технологии',
    startYear: 1980,
    endYear: 2000,
    dates: [
      {
        year: 1981,
        eventDescription:
          'Выпуск ПК IBM изменил подход к вычислениям и технологиям.',
      },
      {
        year: 1991,
        eventDescription:
          'Создание World Wide Web изменило интернет и доступ к информации.',
      },
      {
        year: 1998,
        eventDescription:
          'Основание Google революционизировало поиск и технологии глобально.',
      },
      {
        year: 2000,
        eventDescription:
          'Соцсети изменили общение, сблизив людей по всему миру.',
      },
    ],
  },
  {
    title: 'Интернет',
    startYear: 2000,
    endYear: 2010,
    dates: [
      {
        year: 2001,
        eventDescription:
          'Выпуск iPod изменил музыку и стал иконой цифровой эпохи.',
      },
      {
        year: 2004,
        eventDescription:
          'Запуск Facebook изменил способ взаимодействия и общения людей.',
      },
      {
        year: 2007,
        eventDescription:
          'Выпуск iPhone изменил рынок смартфонов и индустрию навсегда.',
      },
      {
        year: 2010,
        eventDescription:
          'Запуск Instagram изменил подход к визуальному контенту и медиа.',
      },
    ],
  },
  {
    title: 'Спорт',
    startYear: 2000,
    endYear: 2020,
    dates: [
      {
        year: 2000,
        eventDescription:
          'Олимпиада в Сиднее установила новые стандарты и достижения.',
      },
      {
        year: 2004,
        eventDescription:
          'Олимпиада в Афинах отметила историческую значимость и возвращение.',
      },
      {
        year: 2008,
        eventDescription:
          'Олимпиада в Пекине продемонстрировала мощь Китая и масштаб.',
      },
      {
        year: 2012,
        eventDescription:
          'Олимпиада в Лондоне получила высокие оценки за организацию.',
      },
      {
        year: 2016,
        eventDescription:
          'Олимпиада в Рио оставила заметный след в истории спорта.',
      },
    ],
  },
]
